emlab-fi/cube_firmware/firmware_backport/sdk/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : CUBE_Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void CUBE_Pins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t Z2_ENABLE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB9 (pin 57)  */
    GPIO_PinInit(CUBE_Z2_ENABLE_GPIO, CUBE_Z2_ENABLE_PIN, &Z2_ENABLE_config);

    gpio_pin_config_t A_ENABLE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 64)  */
    GPIO_PinInit(CUBE_A_ENABLE_GPIO, CUBE_A_ENABLE_PIN, &A_ENABLE_config);

    gpio_pin_config_t B_ENABLE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin 65)  */
    GPIO_PinInit(CUBE_B_ENABLE_GPIO, CUBE_B_ENABLE_PIN, &B_ENABLE_config);

    gpio_pin_config_t Z1_ENABLE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB23 (pin 69)  */
    GPIO_PinInit(CUBE_Z1_ENABLE_GPIO, CUBE_Z1_ENABLE_PIN, &Z1_ENABLE_config);

    gpio_pin_config_t A_FAULT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 70)  */
    GPIO_PinInit(CUBE_A_FAULT_GPIO, CUBE_A_FAULT_PIN, &A_FAULT_config);

    gpio_pin_config_t X_LIMIT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 72)  */
    GPIO_PinInit(CUBE_X_LIMIT_GPIO, CUBE_X_LIMIT_PIN, &X_LIMIT_config);

    gpio_pin_config_t TMC429_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 76)  */
    GPIO_PinInit(CUBE_TMC429_INT_GPIO, CUBE_TMC429_INT_PIN, &TMC429_INT_config);

    gpio_pin_config_t Z2_FAULT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 77)  */
    GPIO_PinInit(CUBE_Z2_FAULT_GPIO, CUBE_Z2_FAULT_PIN, &Z2_FAULT_config);

    gpio_pin_config_t Z1_FAULT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 79)  */
    GPIO_PinInit(CUBE_Z1_FAULT_GPIO, CUBE_Z1_FAULT_PIN, &Z1_FAULT_config);

    gpio_pin_config_t B_FAULT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 81)  */
    GPIO_PinInit(CUBE_B_FAULT_GPIO, CUBE_B_FAULT_PIN, &B_FAULT_config);

    gpio_pin_config_t TOGGLE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin 82)  */
    GPIO_PinInit(CUBE_TOGGLE_GPIO, CUBE_TOGGLE_PIN, &TOGGLE_config);

    gpio_pin_config_t Z_LIMIT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC16 (pin 90)  */
    GPIO_PinInit(CUBE_Z_LIMIT_GPIO, CUBE_Z_LIMIT_PIN, &Z_LIMIT_config);

    gpio_pin_config_t Y_LIMIT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC17 (pin 91)  */
    GPIO_PinInit(CUBE_Y_LIMIT_GPIO, CUBE_Y_LIMIT_PIN, &Y_LIMIT_config);

    /* PORTB18 (pin 64) is configured as PTB18 */
    PORT_SetPinMux(CUBE_A_ENABLE_PORT, CUBE_A_ENABLE_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[18] = ((PORTB->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is disabled on the corresponding pin. */
                      | PORT_PCR_ODE(kPORT_OpenDrainDisable)

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB19 (pin 65) is configured as PTB19 */
    PORT_SetPinMux(CUBE_B_ENABLE_PORT, CUBE_B_ENABLE_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[19] = ((PORTB->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is disabled on the corresponding pin. */
                      | PORT_PCR_ODE(kPORT_OpenDrainDisable)

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB23 (pin 69) is configured as PTB23 */
    PORT_SetPinMux(CUBE_Z1_ENABLE_PORT, CUBE_Z1_ENABLE_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[23] = ((PORTB->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is disabled on the corresponding pin. */
                      | PORT_PCR_ODE(kPORT_OpenDrainDisable)

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

