emlab-fi/cube_firmware/firmware_backport/sdk/board/pin_mux.c
    /* PORTB9 (pin 57) is configured as PTB9 */
    PORT_SetPinMux(CUBE_Z2_ENABLE_PORT, CUBE_Z2_ENABLE_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[9] = ((PORTB->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Open Drain Enable: Open drain output is disabled on the corresponding pin. */
                     | PORT_PCR_ODE(kPORT_OpenDrainDisable)

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTC0 (pin 70) is configured as PTC0 */
    PORT_SetPinMux(CUBE_A_FAULT_PORT, CUBE_A_FAULT_PIN, kPORT_MuxAsGpio);

    /* PORTC10 (pin 82) is configured as PTC10 */
    PORT_SetPinMux(CUBE_TOGGLE_PORT, CUBE_TOGGLE_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 90) is configured as PTC16 */
    PORT_SetPinMux(CUBE_Z_LIMIT_PORT, CUBE_Z_LIMIT_PIN, kPORT_MuxAsGpio);

    /* PORTC17 (pin 91) is configured as PTC17 */
    PORT_SetPinMux(CUBE_Y_LIMIT_PORT, CUBE_Y_LIMIT_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 72) is configured as PTC2 */
    PORT_SetPinMux(CUBE_X_LIMIT_PORT, CUBE_X_LIMIT_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 73) is configured as CLKOUT */
    PORT_SetPinMux(CUBE_CLOCK_20_PORT, CUBE_CLOCK_20_PIN, kPORT_MuxAlt5);

    /* PORTC4 (pin 76) is configured as PTC4 */
    PORT_SetPinMux(CUBE_TMC429_INT_PORT, CUBE_TMC429_INT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC4 (pin 76): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(CUBE_TMC429_INT_PORT, CUBE_TMC429_INT_PIN, kPORT_InterruptOrDMADisabled);

    /* PORTC5 (pin 77) is configured as PTC5 */
    PORT_SetPinMux(CUBE_Z2_FAULT_PORT, CUBE_Z2_FAULT_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 79) is configured as PTC7 */
    PORT_SetPinMux(CUBE_Z1_FAULT_PORT, CUBE_Z1_FAULT_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 81) is configured as PTC9 */
    PORT_SetPinMux(CUBE_B_FAULT_PORT, CUBE_B_FAULT_PIN, kPORT_MuxAsGpio);

    SIM->SOPT2 = ((SIM->SOPT2 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT2_CLKOUTSEL_MASK)))

                  /* CLKOUT select: FlexBus CLKOUT. */
                  | SIM_SOPT2_CLKOUTSEL(SOPT2_CLKOUTSEL_FLEXBUS));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
CUBE_UART0Pins:
- options: {callFromInitBoot: 'true', prefix: CUBE_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '63', peripheral: UART0, signal: TX, pin_signal: PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/FB_AD16/EWM_OUT_b, identifier: UART0_TX, direction: OUTPUT, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
  - {pin_num: '62', peripheral: UART0, signal: RX, pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/EWM_IN, identifier: UART0_RX, slew_rate: fast, open_drain: disable,
    drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : CUBE_UART0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void CUBE_UART0Pins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t UART0_RX = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain is disabled */
                                        kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as UART0_RX */
                                        kPORT_MuxAlt3,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTB16 (pin 62) is configured as UART0_RX */
    PORT_SetPinConfig(CUBE_UART0_RX_PORT, CUBE_UART0_RX_PIN, &UART0_RX);

    const port_pin_config_t UART0_TX = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain is disabled */
                                        kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as UART0_TX */
                                        kPORT_MuxAlt3,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTB17 (pin 63) is configured as UART0_TX */
    PORT_SetPinConfig(CUBE_UART0_TX_PORT, CUBE_UART0_TX_PIN, &UART0_TX);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK)))

                  /* UART 0 transmit data source select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
CUBE_I2CPins:
- options: {callFromInitBoot: 'true', prefix: CUBE_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '32', peripheral: I2C0, signal: SDA, pin_signal: ADC0_SE18/PTE25/UART4_RX/I2C0_SDA/EWM_IN, identifier: I2C_SDA, slew_rate: fast, open_drain: enable,
    drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
  - {pin_num: '31', peripheral: I2C0, signal: SCL, pin_signal: ADC0_SE17/PTE24/UART4_TX/I2C0_SCL/EWM_OUT_b, identifier: I2C_SCL, slew_rate: fast, open_drain: enable,
    drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

